#include <iostream>
#include "basics.h"


void basics() {
	std::cout << "OOP Basics" << std::endl;
	// Поліморфізм - поєднання до єдиного масиву (колекції)
	// об'єктів різного типу. Формально, об'єкти мають
	// тип (базового класу), при цьому фактично є об'єктами 
	// похідних (дочірніх) типів
	Product* stock[2];

	stock[0] = (new Laptop())
		->setHardware("Intel Core 5, RAM 16GB, SSD 512GB")
		->setPower(90)
		->setName("Acer Nitro")
		->setPrice(60499);
	stock[1] = (new Monitor())
		->setDiagonal(32)
		->setPower(120)
		->setName("Dell Vision")
		->setPrice(7950);

	for (auto product : stock) {
		std::cout << product ->toString() << std::endl;
	}

}


/*
Основні принципи ООП.
Абстрагування, спадкування, поліморфізм, інкапсуляція.

Абстракція - термін, що означає поєднання деякої множини сутностей.
Приклад - природна мова. Майже будь-яке слово значит множину.
"Телефон" - величезна множина реальних речей (сутностей).
Машинним мовам абстракція не власна, інструкції мають чітке вираження.
Абстрагування - побудова мовних конструкцій, здатних поєднувати
множинні властивості (сутності та інші абстракції).

Створення абстракцій передбачає вивчення (аналіз) предметної області
(чому присвячена програма). Наприклад, крамниця. Виписуємо усі товари,
що мають бути в крамниці, з усіма їх важливими характеристиками.

Ноутбук           Монітори          Миша               Клавіатура
 - назва           - назва           - назва            - назва      
 - ціна            - ціна            - ціна             - цін
 - "залізо"        - Діагональ       - DPI              - тип  
 - потужність      - потужність      - підключення      - підключення

1) Знаходимо, що є спільного у ВСІХ сутностей: назва та ціна
формуєму вищу абстракцію: товар (Product), що поєднує все, що в нас є
                           Product
						   - назва  -- інкапсуляція - переміщення спільних
						   - ціна      властивостей до абстракції
	    /                 /            \             \
Ноутбук           Монітори          Миша               Клавіатура
 - "залізо"        - Діагональ       - DPI              - тип
 - потужність      - потужність      - підключення      - підключення

2) Знаходимо групи зі спільними властивостями і будуємо наступний рівень
абстракцій:
 Електротовари (-потужність)       Периферія (-підключення)

                          Product
						- назва - ціна
					/                    \
	          Електротовари           Перифірія
			  - потоужність           - підключення
			  /           \             /         \
		   Ноутбук      Монітор        Миша     Клавіатури
		   - "залізо"  - діагональ     - DPI    - тип

повторюємо п.2) для всіх можливих групувань
---------------
Спадкування - механізм реалізації абстрагування - створеннч класів на 
базі інших класів з їх розширенням. Дочірній клас (нащадок) повністю
включає в себе батьківський клас і може додавати власні елементи
--------------
Віртуальні методи
Різниця між віртуальними та не віртуальними методами виникає коло тип
даних посилання на об'єкт та тип самого об'єкта не є однаковим.
(посилання через батьківський єлемент)
Electrical* stock = new Laptop()
тип посилання (stok) - Electrical*
тип об'єкту - Laptop*
Віртуальні методи виктикаються у об'єкта
	stok->v -- Laptop::v
Невіртуальні методи - за типом даних
	stok->nv() -- Electrical::nv
Невіртуальні методи створюються за замовчанням,
для створення віртуальних необхідно додати оператор "virtual"
*/