#include "data_structures.h"
#include <iostream>

template<typename T>                 // Шаблоннимиможуть бути функції та типи (класи, структури)
void print(T arg) {                  // Шаблон вводить "змінну" для типу, традиційно "T"
    std::cout << arg                 // В самій функції (чи типі) ця "T" вживається там,
        << std::endl;                // де пізніше має бути реальний тип даних
}                                    // Далі компілятор шукає усі вжитки даного шаюлону...

template<typename T>                 // Перед кожним оголошенням повторюється template
struct fraction {                    // Для типів (наприклад, структур) шаблон "T"
    T numerator;                     // може вживатись для оголошення полів
    T denominator;                   // чи методів.
    void print() {                   // Якщо метод не залежить від "T", то
        std::cout                    // в його тілі не робимо відповідних позначок
            << numerator             //
            << '/'                   //
            << denominator;          //
    }                                //
    T get_numerator() {
        return numerator;
    }
    void set_numerator(T n) {
        numerator = n;
    }
};                                   //

void data_structures() {
	std::cout << "Data structurea and templates" << std::endl;
    print("Template functions demo");  // . . . і для кожного конкретного вжитку 
    print(42);                         // створює колпію шаблона під даний "T"
    print(true);                       // Тобто у підсумку буде кілька (4) різні
    print('A');                        // фукції під кожен тип окремо
    print<short>(42);                  // прямо вказати тип додаємо <тип>

    fraction<int> f1{ 1, 2 };          // Для різних конкретних типів також
    fraction<float> f2{ 1.5, 2.5 };    // буде створено різні структури за
    fraction<short> f3{ 2, 3 };        // єдиним шаблоном
    f1.print(); std::cout << std::endl;
    f2.print(); std::cout << std::endl;
    f3.print(); std::cout << std::endl;
}

/*
Структури даних та шаблонне програмування
1. Структури даних - типові способи організації даних,
   поширені в різних практичних задачах.
- Стек (Stack) - спосіб за якого дані накопичуються
   в одному порядку, а віводяться в іншому (First In Last Out - FILO)
   3 -> 2 -> 1 -> [Stack]
   [Stack] -> 3
   Вживається, закрема, у механізмі виклику функцій
   a(b(c(x))):   1) c(x),   2) b(res),   3) a(res)
- Черга (Queue) - (First In First Out - FIFO) - прямий
   порядок передачі накоплених даних.
   Може вживатися для буферизації, коли швидкість обробки
   не точно дорівнює швидкості передачі даних
   File -> 1 -> 2 -> 3 -> [Queue] -> 1 -> [Process]
- Списки (Lists) - колекції з можливістю додавання, вставлення,
   вилучення даних. На відміну від стека та черги, доступ можливий
   до довільного єлементу списка. Розрізняють зв'язані спики та 
   списки-масиви:
   = зв'язані списки (Linked List) зберігають дані та посилання 
     на інші "вузли" списку (або тільки на наступний,
     або і на наступний і на попередній)
   = списки-масиви (Arrey List) "тримають" масив із запасом,
     за потреби більшого разширення масив перекопійовується
     у більший масив
  Порівняння: масиви дозволяють швидко одержати елемент за довільнис
   індексом, тоді як зв'язані списки "шукають" елементи
   переходячи до сусідних певну кількість разів -- пошук швидкий у масивах.
   1 <-> 2 <-> 3 <-> 4 <-> 5
   Недолік масивів полягає в опереціях вставки елементів в середину або
   вилучення з середини. В такому разі решта елементів має "посунутись"
   1 2 3 4 5 6 7     тоді як для зв'язаних списків необходно лише
                     преставляти показчики на інших сусідів
    1 2 - 4 5 6 7         1 <-> 2 <-> 3 <-> 4 <-> 5
          <-
    1 2 4 5 6 7           1 <-> 2 <--------> 4 <-> 5

    1 2 4 5 6 7           1 <-> 2 <--------> 4 <-> 5
        10                               10
    1 2 3 4 5 6 7         1 <-> 2             4 <-> 5 <-> 6 <-> 7
                                  \           /
                                   <->  10 <->
 Вибір між видаими списків робиться за аналізу операцій, що с ними виконуються:
 якщо список будується один раз, а далі тільки одержуються елементи
  (наприкоад, зчитати файл і потім працювати з даними), тоді краще масив
 якщо список весь час змінюється (наприклад, ігрові елементи - спавняться,
  збиваються, зникають), тоді краще зв'язаний список

- Множина (Set) - набір з унікальними значеннями (що не повторюються)
   зазвичай в множинах реалізується швидкий пошук завдяки організації
   бінарним деревом. Стректура схожа з зв'язаним списком, але має два
   показчики - на лівий вузол (з меншим значенням) та правий вузол (з
   більшим значенням)
   Медіана - елемент множини, який ділить її навпіл: як менших, так і більшмх
   елементів є порівну. Якщо в множини непарна кількість елементів, то
   медіана є середнім елементом. Якщо парна, то середнє від центральних
   (0 1 2 3 4 5 6 7 8 9 10)
                           5
                        /     \
                (0 1 2 3 4)  (6 7 8 9 10) 

                           5                                  5
                         /   \                             /   \
                        2     8                           2      8
                       / \   / \                        / \     / \
                      1   4 6   9                      0   3    6   9
                     /    / \    \                     \   \    \    \
                    0    3  7    10                     1    4  7    10
2^3 = 8; 2^4 =16;  2^5 = 32;  2^10 =1024
1000 елементів - пошук до 10 разів
1млн елементів - до 20
1млрд - до 30

- Асоціативні масиви (Map, Dictionary, Yfsh-Table) - структури даних,
   в яких індексаксація може бути не числова. Їх також називають 
   "множинами ключ-значення", вживаючи замість терміну "індекс" термін "ключ".
   Вживаються при введенні доменних імен (імен вузлів мережі, які в
   самій мережі адресується числом)
   host ={
        "itstep.org" => 123.3.16.7,
        "google.com" => 8.8.8.8,
        "gooogle.com.ua" => 23.53.6.32,
   }
   hosts["itstep.org"]
*/
/*
Узагальнене (шаблонне) програмування.
Структури даних передбачають організацію даних, але нічого не
зазначають про типи даних. Якщо потрібна організація для 
даних різного типу, то складається враження що необхідно 
створювати декілька однакових за схемою структур, але з разними
типами даних в середині: список для цілих чисел, список за дробових
список для рядків тощо.
Узагальнене програмування дозволяє зробити структури даних, що
можуть працювати з різними типами внутрішніх даних: описати
шаблон, який буде реалізовуватись для конкретних типів у програмі.
*/