#include "data_structures.h"
#include <iostream>

void data_structures() {
	std::cout << "Data structurea" << std::endl;
}

/*
Структури даних та шаблонне програмування
1. Структури даних - типові способи організації даних,
   поширені в різних практичних задачах.
- Стек (Stack) - спосіб за якого дані накопичуються
   в одному порядку, а віводяться в іншому (First In Last Out - FILO)
   3 -> 2 -> 1 -> [Stack]
   [Stack] -> 3
   Вживається, закрема, у механізмі виклику функцій
   a(b(c(x))):   1) c(x),   2) b(res),   3) a(res)
- Черга (Queue) - (First In First Out - FIFO) - прямий
   порядок передачі накоплених даних.
   Може вживатися для буферизації, коли швидкість обробки
   не точно дорівнює швидкості передачі даних
   File -> 1 -> 2 -> 3 -> [Queue] -> 1 -> [Process]
- Списки (Lists) - колекції з можливістю додавання, вставлення,
   вилучення даних. На відміну від стека та черги, доступ можливий
   до довільного єлементу списка. Розрізняють зв'язані спики та 
   списки-масиви:
   = зв'язані списки (Linked List) зберігають дані та посилання 
     на інші "вузли" списку (або тільки на наступний,
     або і на наступний і на попередній)
   = списки-масиви (Arrey List) "тримають" масив із запасом,
     за потреби більшого разширення масив перекопійовується
     у більший масив
  Порівняння: масиви дозволяють швидко одержати елемент за довільнис
   індексом, тоді як зв'язані списки "шукають" елементи
   переходячи до сусідних певну кількість разів -- пошук швидкий у масивах.
   1 <-> 2 <-> 3 <-> 4 <-> 5
   Недолік масивів полягає в опереціях вставки елементів в середину або
   вилучення з середини. В такому разі решта елементів має "посунутись"
   1 2 3 4 5 6 7     тоді як для зв'язаних списків необходно лише
                     преставляти показчики на інших сусідів
    1 2 - 4 5 6 7         1 <-> 2 <-> 3 <-> 4 <-> 5
          <-
    1 2 4 5 6 7           1 <-> 2 <--------> 4 <-> 5

    1 2 4 5 6 7           1 <-> 2 <--------> 4 <-> 5
        10                               10
    1 2 3 4 5 6 7         1 <-> 2             4 <-> 5 <-> 6 <-> 7
                                  \           /
                                   <->  10 <->
 Вибір між видаими списків робиться за аналізу операцій, що с ними виконуються:
 якщо список будується один раз, а далі тільки одержуються елементи
  (наприкоад, зчитати файл і потім працювати з даними), тоді краще масив
 якщо список весь час змінюється (наприклад, ігрові елементи - спавняться,
  збиваються, зникають), тоді краще зв'язаний список

- Множина (Set) - набір з унікальними значеннями (що не повторюються)
   зазвичай в множинах реалізується швидкий пошук завдяки організації
   бінарним деревом. Стректура схожа з зв'язаним списком, але має два
   показчики - на лівий вузол (з меншим значенням) та правий вузол (з
   більшим значенням)
   Медіана - елемент множини, який ділить її навпіл: як менших, так і більшмх
   елементів є порівну. Якщо в множини непарна кількість елементів, то
   медіана є середнім елементом. Якщо парна, то середнє від центральних
   (0 1 2 3 4 5 6 7 8 9 10)
                           5
                        /     \
                (0 1 2 3 4)  (6 7 8 9 10)

                           5                                    5
                         /   \                               /   \
                        2     8                             2     8
                       / \   / \                           / \   / \
                      1   4 6   9                         0   3 6   9
                     /    / \    \                       \   \ \    \
                     0    3  7    10                     1    4  7    10
*/