/*
ООП. Вступ.
Парадигма - термін, що поєднує традиції, підходи, прийоми, методики тощо.
у програмуванні існують декілька парадигм:
- Імперативна парадигма  ( в яку входить процедурний підхід)
   програма вважаеться послідовністю інструкцій, серед яких лише одна
   виконується у даний момент часу. Окремі інструкції програми дозволяють
   змінювати порядок виконання (умови, цикли )
   Процедурний підхід - організація коду у вигляді набору процедур, тіла
   яких є послідовностями інструкцій
- Функціональна парадигма - базується на математично-функціональних засадах
   програма вважаеться "конвертом" у якому лежить інструкція, що слід
   зрабити, та новий "конверт" над яким слід виконати дію.
   Представники: LISP, Python, J, TCL, Haskel
- Декларативна парадигма (в яку входить логічна) - базується на теорії знань
   програма складається за набору правил (аксіом) та тверження, яке
   слід пперевірити (теореми) 
   Представник: Prolog (5 покоління)
- Об'єктно-орієнтована парадигма (ООП) - базується на принципах взаємодії
   Розроблялась як засіб описання еволюційних систем, у яких задаються
   об' єкти та правила їх взаємодіїю Суть програми - еволюція системи об'эктів
   З точки зору практичного програмування вносить ідею колекцій - як 
   розвиток поняття масиву, але з можливістю змін розміру (через еволюцію -
   роботу програми)
   Представники ООП: C#, Java, прототипної підпарадигми: JavaScript, Python, PHP
*/